


### ❌ Destructive Terraform changes has been detected.

| Icon | Action | Amount |
|:----:|:--------:|:------:|
| 🟥  | Deletions | 5      |
| 🟧  | Changes  | 1      |
| 🟦  | New.         | 2      |

---

❌ **aws_flow_log** plan is complete. 2 issues have been found. [(View Details)](https://example.com)

✅ **workload_ecs** check is complete. No issues have been found. [(View Details)](https://example.com)

---

Plan

```terraform

  # module.freshclinics_workload_vpc.module.vpc.aws_flow_log.this[0] will be created
+  resource "aws_flow_log" "this" {
+      arn                      = (known after apply)
+      id                       = (known after apply)
+      log_destination          = "arn:aws:s3:::freshclinics-foundational-observability-flow-logs"
+      log_destination_type     = "s3"
+      log_format               = (known after apply)
+      log_group_name           = (known after apply)
+      max_aggregation_interval = 600
+      tags_all                 = {
+          "terraform" = "true"
        }
+      traffic_type             = "ALL"
+      vpc_id                   = "vpc-01aedfdc0ecae8f5d"
        # (1 unchanged attribute hidden)

+      destination_options {
+          file_format                = "parquet"
+          hive_compatible_partitions = true
+          per_hour_partition         = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```